* Introduction

We will briefly analyz the Rossmann dataset. This analysis will be aimed towards identifying any pecularities of the data that could be useful for building learners.

From Kaggle we have the following information on the data-set,

Most of the fields are self-explanatory. The following are descriptions for those that aren't. 
1. Id - an Id that represents a (Store, Date) duple within the test set
2. Store - a unique Id for each store
3. Sales - the turnover for any given day (this is what you are predicting)
4. Customers - the number of customers on a given day
5. Open - an indicator for whether the store was open: 0 = closed, 1 = open
6. StateHoliday - indicates a state holiday. Normally all stores, with few exceptions, are closed on state holidays. Note that all schools are closed on public holidays and weekends. a = public holiday, b = Easter holiday, c = Christmas, 0 = None
7. SchoolHoliday - indicates if the (Store, Date) was affected by the closure of public schools
8. StoreType - differentiates between 4 different store models: a, b, c, d
9. Assortment - describes an assortment level: a = basic, b = extra, c = extended
10. CompetitionDistance - distance in meters to the nearest competitor store
11. CompetitionOpenSince[Month/Year] - gives the approximate year and month of the time the nearest competitor was opened
12. Promo - indicates whether a store is running a promo on that day
13. Promo2 - Promo2 is a continuing and consecutive promotion for some stores: 0 = store is not participating, 1 = store is participating
14. Promo2Since[Year/Week] - describes the year and calendar week when the store started participating in Promo2
15. PromoInterval - describes the consecutive intervals Promo2 is started, naming the months the promotion is started anew. E.g. "Feb,May,Aug,Nov" means each round starts in February, May, August, November of any given year for that store

The primary data is in the file train.csv, and secondary data in
store.csv,

** Load Data

#+BEGIN_SRC R :session
  training <- read.csv("../data/train.csv")
  testing <- read.csv("../data/test.csv")
  store <- read.csv("../data/store.csv")
#+END_SRC

#+BEGIN_SRC R :session
print(dim(training))
#+END_SRC

#+RESULTS:
| 1017209 |
|       9 |


